{
  "recipes": [
    {
      "id": 0,
      "recipeName": "Avocado on Toast",
      "recipeImage": "https://data.thefeedfeed.com/static/other/15290716095b23c7f92821a.jpg",
      "recipeIng": ["One avocado","Two slices of toast","Olive oil", "2 eggs", "Pinch of salt", "Pinch of Chilli Flakes"],
      "recipeSteps": [
        "Author: Rafee R", "Cut the avocado in half and remove the stone.", "Scoop the insides out.", "Mash with a fork until chunky.", "Toast the bread.", "Spread the avocado onto the toast, making sure they are both covered equally.", "Season with chilli flakes and salt.", "Drizzle olive oil on top.", "Fry the eggs and place them on top.", "Serve."
      ]
    },
    {
      "id": 1,
      "recipeName": "French Toast",
      "recipeImage": "https://www.simplyrecipes.com/thmb/ugrWqwmXaqc6t6PBPF3lPnphakc=/736x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2014__10__french-toast-horiz-a-1200-42691144a0d8494c9da43e4c46e61e2f.jpg",
      "recipeIng": ["4 large eggs","2/3 cup milk","2 teaspoons cinnamon", "8 thick slices 2-day-old bread" , "Butter", "Maple syrup"],
      "recipeSteps": [
        "Author: Elise Bauer - Simplyrecipes","In a medium bowl, whisk together the eggs, milk, and cinnamon.", "Whisk the mixture until well blended and pour into a shallow bowl, wide enough to place a slice of the bread you will be using.", "Add Sugar and Vanilla", "Soak both sides of the bread in the mixture", "Fry the French toast until browned on one side, then flip and brown the other side.", "Serve with toppings of your choice"
      ]
    },
    {
      "id": 2,
      "recipeName": "Tomato Bacon Pasta",
      "recipeImage": "https://www.recipetineats.com/wp-content/uploads/2017/05/Bacon-Tomato-Pasta-3-landscape.jpg",
      "recipeIng": ["160 g spaghetti","1 tsp olive oil ","180 g bacon, diced", "1 garlic clove, minced", "1/2 onion , finely diced", "400 g canned crushed tomato", "Salt and pepper", "Extra virgin olive oil", "Parsely, finely diced"],
      "recipeSteps": [
        "Author: Nagl - Recipetineats ", "Bring a large pot of water to the bowl.", "Add a pinch of salt.", "Cook pasta according to packet but MINUS 2 minutes.", "Meanwhile, heat oil in a skillet over high heat.", "Add bacon and cook for 1 minute, then add garlic and onion and cook for 3 minutes or until onion is translucent and bacon is golden.", "Scoop out a mug of pasta cooking water, then pour about 1/2 cup into the skillet.", "Bring to simmer and stir, scraping the skillet to dissolve in all the golden bits stuck on the pan into the liquid.", "Add tomato, bring to simmer and cook for 2 minutes, then turn down to medium high.", "Drain pasta, or if you timed it right, use tongs to transfer it straight from the pot into the skillet.", "Toss gently using two wooden spoons for 2 minutes, or until the sauce is no longer sitting in the skillet (If it gets too thick, just add an extra splash of the pasta cooking water)", "Season with salt and pepper", "Serve immediately, garnished with parmesan, parsley and final drizzle of olive oil if desired."
      ]
    },
    {
      "id": 3,
      "recipeName": "Gnocchi Bake",
      "recipeImage": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/gnocchi-1d16725.jpg?quality=90&webp=true&resize=440,400",
      "recipeIng": ["1 tbsp olive oil","1 onion , finely chopped","2 garlic cloves , crushed", "120g chorizo , diced", "2 x 400g cans chopped tomatoes", "1 tsp caster sugar", "600g fresh gnocchi", "125g mozzarella ball, cut into chunks", "small bunch of basil , torn", "green salad , to serve"],
      "recipeSteps": [
        "Author:  Marianne Turner - BBC","Heat the oil in a medium pan over a medium heat", "Fry the onion and garlic for 8-10 mins until soft.", "Add the chorizo and fry for 5 mins more", "Tip in the tomatoes and sugar, and season." , "Bring to a simmer, then add the gnocchi and cook for 8 mins, stirring often, until soft." , "Heat the grill to high." , "Stir Â¾ of the mozzarella and most of the basil through the gnocchi." , "ivide the mixture between six ovenproof ramekins, or put in one baking dish." , "Top with the remaining mozzarella, then grill for 3 mins, or until the cheese is melted and golden." , "Season, scatter over the remaining basil and serve with green salad."
      ]
    },
    {
      "id": 4,
      "recipeName": "Pot Creamy Mushroom Pasta",
      "recipeImage": "https://www.kitchensanctuary.com/wp-content/uploads/2021/10/Creamy-Mushroom-Pasta-square-FS-51-1.jpg",
      "recipeIng": ["4 cloves garlic", "8 oz. baby Bella mushrooms", "2 Tbsp butter", "1/8 tsp salt", "1/8 tsp freshly cracked pepper", "8 oz. fettuccine", "2.5 cups vegetable broth", "1/3 cup heavy cream", "1/4 cup grated Parmesan"],
      "recipeSteps": ["Author: Beth – Budget Bytes", "Mince the garlic and slice the mushrooms.", "Add the butter and garlic to a deep skillet and sauté over medium heat for one minute.", "Add the sliced mushrooms, salt, and pepper, and continue to sauté until the mushrooms have softened, all of their moisture has evaporated from the skillet, and the edges are beginning to brown.", "Add the fettuccine to the skillet along with the vegetable broth and stir to combine.", "It's okay if the broth doesn't fully submerge the pasta.", "Place a lid on the skillet, turn the heat up to medium-high, and allow the broth to come up to a boil.", "When it reaches a boil, give the pasta a quick stir, replace the lid, then turn the heat down to medium-low.", "Continue to let the pasta simmer in the broth for about 10 minutes, stirring occasionally (always replacing the lid), or until the pasta is tender.", "There should be a little saucy liquid left in the bottom of the skillet.", "Add the heavy cream to the skillet and stir to combine.", "Turn the heat off then add the Parmesan and continue to stir the pasta until the Parmesan is melted.", "Give the pasta a taste and add salt or pepper if needed.", "Serve"]
    }
  ]
}